In [29]:
import pandas as pd

In [30]:
df=pd.read_csv('parks.csv',index_col=['Park Code'])
#to change index column to Park Code

In [31]:
df.head()

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50
BIBE       Big Bend National Park    TX  801163     29.25    -103.25
BISC       Biscayne National Park    FL  172924     25.65     -80.08

In [32]:
df.iloc[2]
#iloc is to access rows

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

In [33]:
df.loc['BADL']

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

In [34]:
df.loc[['BADL','BIBE','BISC']]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
BIBE       Big Bend National Park    TX  801163     29.25    -103.25
BISC       Biscayne National Park    FL  172924     25.65     -80.08

In [35]:
df.iloc[[2,1,0]]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

In [12]:
df[:3]

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [13]:
df[3:6]

,Park Name,State,Acres,Latitude,Longitude
Park Code,,,,,
BIBE,Big Bend National Park,TX,801163,29.25,-103.25
BISC,Biscayne National Park,FL,172924,25.65,-80.08
BLCA,Black Canyon of the Gunnison National Park,CO,32950,38.57,-107.72

In [14]:
#I can also access a single column as if it were an attribute of the dataframe, but only if the name has no spaces, uses only basic characters, and doesn't share a name with a dataframe method. So, df.State works
df.State.head(3)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: State, dtype: object

In [27]:
#df.Park Code

In [23]:
#df.columns=[col.replace(' ', '_').lower() for col in df.columns]

AttributeError: 'builtin_function_or_method' object has no attribute 'replace'

In [17]:
#print(df.columns)

Index([<built-in method lower of str object at 0x0000003140BB1930>,
       <built-in method lower of str object at 0x00000031415287B0>,
       <built-in method lower of str object at 0x0000003141528A70>,
       <built-in method lower of str object at 0x0000003140BFDED0>,
       <built-in method lower of str object at 0x0000003140BFDC90>],
      dtype='object')

In [39]:
df[['State','Acres']][:3]

          State   Acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

In [40]:
(df.State=='UT').head(3)

Park Code
ACAD    False
ARCH     True
BADL    False
Name: State, dtype: bool

In [41]:
df[df.State=='UT']

                            Park Name State   Acres  Latitude  Longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

In [43]:
df[(df.Latitude>60)|(df.Acres>10**6)].head(3)

,Park Name,State,Acres,Latitude,Longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
EVER,Everglades National Park,FL,1508538,25.32,-80.93

In [44]:
df[df['Park Name'].str.split().apply(lambda x:len(x)==3)].head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [46]:
df[df.State.isin(['WA','CA','OR'])].head()
#isin method

                               Park Name State   Acres  Latitude  Longitude
Park Code
CHIS       Channel Islands National Park    CA  249561     34.01    -119.42
CRLA           Crater Lake National Park    OR  183224     42.94    -122.10
JOTR           Joshua Tree National Park    CA  789745     33.79    -115.90
LAVO       Lassen Volcanic National Park    CA  106372     40.49    -121.51
MORA         Mount Rainier National Park    WA  235625     46.85    -121.75